---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.DividePerimeterZoneFailed
source: html/4220bc7d-1430-03ae-3bca-d34c2ef88e0a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.DividePerimeterZoneFailed Property

Failed to divide perimeter zone.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividePerimeterZoneFailed { get; }
```